MyHome/src/Documents/мх_ВозвратРасходов/мх_ВозвратРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мх_ВозвратРасходов</name>
  <basedOn>Document.мх_РегистрацияРасходов</basedOn>
  <registerRecords>AccumulationRegister.мх_ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.мх_Расходы</registerRecords>
  <registerRecords>AccumulationRegister.мх_ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРасхода</name>
    <type>
      <types>DocumentRef.мх_РегистрацияРасходов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Кошелек</name>
      <type>
        <types>CatalogRef.мх_КошелькиИСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.мх_СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.мх_СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРасхода</name>
      <type>
        <types>DocumentRef.мх_РегистрацияРасходов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyHome/src/Documents/мх_ВозвратРасходов/Forms/ПодборРасходов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ПериодРасходов") Тогда
		ПериодРасходов = Параметры.ПериодРасходов;
		ЗаполнитьДеревоРасходовНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	РазвернутьДерево();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗаполнитьДеревоРасходов(Команда)
	ЗаполнитьДеревоРасходовНаСервере();
	РазвернутьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПодбор(Команда)
	
	Данные = ПодобранныеДанные();
	Закрыть(Данные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПодобранныеДанные()
	
	МассивСтрок = Новый Массив; 
	
	ЗаполнитьПодобранныеДанные(ДеревоРасходов, МассивСтрок);
	
	Возврат МассивСтрок;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПодобранныеДанные(ВеткаДерева, МассивСтрок)
	
	ДочерниеЭлементы = ВеткаДерева.ПолучитьЭлементы();
	Для каждого Элемент из ДочерниеЭлементы Цикл
		
		Если ЗначениеЗаполнено(Элемент.СтатьяРасходов)
			И Элемент.Подобрать Тогда
				
			СтруктураСтроки = НоваяСтруктураСтрокиПодобранныхДанных();
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, Элемент);
			МассивСтрок.Добавить(Элемент);				
				
		КонецЕсли;
		
		ЗаполнитьПодобранныеДанные(Элемент, МассивСтрок);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция НоваяСтруктураСтрокиПодобранныхДанных()
	
	СтруктураСтроки = Новый Структура("ДокументРасхода, СтатьяРасходов, АналитикаРасходов, Сумма, Содержание, ДатаОперации");
	
	Возврат СтруктураСтроки;
	
КонецФункции

Процедура ЗаполнитьДеревоРасходовНаСервере()

	Дерево = Документы.мх_ВозвратРасходов.ДеревоРасходовЗаПериод(ПериодРасходов.ДатаНачала, ПериодРасходов.ДатаОкончания);

	ЗначениеВРеквизитФормы(Дерево, "ДеревоРасходов");
	
	ЗаполнитьПредставленияСтрокДерева(ДеревоРасходов);

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРасходовПодобратьПриИзменении(Элемент)

	УстановитьФлагПодбораДляДочернихЭлементов();
	УстановитьФлагПодбораДляРодителей();

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПредставленияСтрокДерева(Дерево)
	
	ДочерниеЭлементы = Дерево.ПолучитьЭлементы();
	
	Для каждого Элемент из ДочерниеЭлементы Цикл
		
		Если ЗначениеЗаполнено(Элемент.СтатьяРасходов) Тогда
			ПредставлениеСтроки = Строка(Элемент.СтатьяРасходов);
		Иначе
			ПредставлениеСтроки = Строка(Элемент.ДокументРасхода);
		КонецЕсли;
		
		Элемент.ПредставлениеСтроки = ПредставлениеСтроки;
		
		ЗаполнитьПредставленияСтрокДерева(Элемент);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево()
	
	ЭлементыДерева = ДеревоРасходов.ПолучитьЭлементы();
	
	Для каждого Элемент из ЭлементыДерева Цикл
		
		ИдЭлемента = Элемент.ПолучитьИдентификатор();
		Элементы.ДеревоРасходов.Развернуть(ИдЭлемента, Истина);
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагПодбораДляРодителей()
	
	ИдСтроки = Элементы.ДеревоРасходов.ТекущаяСтрока;

	Если ИдСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = ДеревоРасходов.НайтиПоИдентификатору(ИдСтроки);
	
	УстановитьФлагПодбораДляРодителейРекурсивно(ДанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагПодбораДляРодителейРекурсивно(Элемент)
	
	Родитель = Элемент.ПолучитьРодителя();
	ФлагРодителя = Ложь;
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВсеДочерниеЭлементы = Родитель.ПолучитьЭлементы();

	Для Каждого Элемент Из ВсеДочерниеЭлементы Цикл
		ФлагРодителя = ФлагРодителя + Элемент.Подобрать;	
	КонецЦикла;
	
	Родитель.Подобрать = ФлагРодителя;
	
	УстановитьФлагПодбораДляРодителейРекурсивно(Родитель);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагПодбораДляДочернихЭлементов()

	ИдСтроки = Элементы.ДеревоРасходов.ТекущаяСтрока;

	Если ИдСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДанныеСтроки = ДеревоРасходов.НайтиПоИдентификатору(ИдСтроки);

	УстановитьФлагПодбораДляДочернихЭлементовРекурсивно(ДанныеСтроки, ДанныеСтроки.Подобрать);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагПодбораДляДочернихЭлементовРекурсивно(КорневойЭлемент, Флаг)

	ДочерниеЭлементы = КорневойЭлемент.ПолучитьЭлементы();

	Для Каждого Элемент Из ДочерниеЭлементы Цикл

		Элемент.Подобрать = Флаг;
		УстановитьФлагПодбораДляДочернихЭлементовРекурсивно(Элемент, Флаг);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
